// Дана последовательность температурных колебаний: -25.4, -27.0 13.0, 19.0, 15.5,
// 24.5, -21.0, 32.5. Объединить данные значения в группы с шагом в 10 градусов.
// Последовательность в подмножноствах не важна.
// Пример: -20:{-25.0, -27.0, -21.0}, 10:{13.0, 19.0, 15.5}, 20: {24.5}, etc.

package main

import (
	"fmt"
	"math"
)

func main() {
	arr := []float64{-25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5}

	res := make(map[int64][]float64) // res = {int: [...], int: [...], etc.}

	for _, elem := range arr {
		// Вычисление соответствующего шага в 10 градусов для температуры
		var key int64
		if math.Signbit(elem) {
			key = int64(math.Floor(-1*elem/10)*10) * -1
		} else {
			key = int64(math.Floor(elem/10) * 10)
		}

		res[key] = append(res[key], elem)
	}

	fmt.Println(res)
}
